export default
const config = {
  semi: true, // Добавляем точку с запятой в конце строк
  singleQuote: true, // Используем одинарные кавычки
  trailingComma: 'all', // Добавляем запятые в конце объектов и массивов
  printWidth: 80, // Максимальная длина строки
  tabWidth: 2, // Ширина табуляции
  useTabs: false, // Используем пробелы вместо табов
  bracketSpacing: true, // Добавляем пробелы между фигурными скобками и содержимым
  arrowParens: 'always', // Всегда оборачиваем аргументы стрелочных функций в скобки
  endOfLine: 'lf', // Используем LF для переноса строк
};
